/* eslint-disable */
const questions0 = ` Что такое git?
 Какие есть системы контроля версий?
 как создать ветку в git?
 что такое HTML?
 что такое CSS?
 как зовут создателя JavaScript?
 в каком году был создан JavasScript?
 Какая текущая версия Javacript?
 Какая прошлая версия Javascript?
 Какого номера версии Javascript не было?
 Как называется комитет, занимающийся развитием JavaScript?
 Для чего нужен файл .gitignore?
 Как добавить в git пустую папку?
 Что такое "линтер"?
 Для чего нужен "prettier"?
 Как открыть DevTools в браузере?
 Как можно добавить javascript на страницу?
 Сколько будет 0.2 + 0.1?
 Что такое breakpoint?
 Какие методы есть у объекта console?
 На странице два элемента с id="awesomeId". Как из javascript найти второй?
 Что такое falsy (ложное) значение? Сколько их?
 Назовите 4 javascript фреймворка
 Назовите 3 javascript библиотеки
 Что такое cookies?
 Что происходит между вводом в адресной строке адреса страницы и появлением страницы на экране?
 Зачем нужен DNS сервер?
 Что такое HTTP?
 Назовите 3 программы-веб сервера
 Назовите 5 программ-браузеров
 Полное название Javascript?
 Что такое "транспиляция" в контексте разработки на Javascript?
 Как в Slack оформить многострочный код?
 Как в Slack оформить однострочный код?
 Что такое "императивное программирование"?
 Что такое ООП?
 Что такое переменная?
 Как объявить переменную? Как инициализировать переменную? Примеры кода
 Виды циклов ( 3 вида )? Примеры использования
 Сколько и какие типы данных в javascript? Примеры создания переменных каждого типа
 Как узнать тип переменной? Пример кода
 Что такое область видимости?
 Как из javascript в брaузере вывести на экран строчку? ( 4-ре способа ) Примеры кода
 Каким образом можно реализовать условное выполнение кода?
 Условные операторы в javascript - какие? Примеры использования
 Что такое тернарный оператор?
 Как обойтись без условных операторов если нужно сделать условное выполнение кода? С примером
 Что такое функция? Какими характеристиками можно описать функцию?
 Как можно создать функцию? 3 способа. C примерами кода
 Что такое объект? Как создать объект? ( 3 способа ) С примерами кода
 Что такое передача по ссылке / передача по значению?
 Что такое минификация и зачем она нужна?
 Как можно добавить javascript код в html страницу? 2 способа. C примерами кода
 Что такое массив?
 Как создать массив? ( 3 способа ) С примером кода
 Как запросить данные у пользователя? с примером кода
 Что такое замыкание?
 Как узнать сколько параметров принимает функция?
 Как узнать есть ли у объекта свойство x ?
 Как сделать ревес строки?
 Как удалить предпоследний элемент в массиве?
 Как заменить в строке "papa roach" все буквы a на A ?
 Сколькими способами ( с примерами кода ) можно найти на странице div с id someId ?
 Что такое API? Примеры?
 Как в js реализовать многопоточность?
 Сколькими способами можно проитерироваться по всем полям объекта? С примерами кода
 Что такое callback ? Зачем? Пример кода
 Почему 1 + '2' ? и 1 - '2' ?
 Как и когда работает преобразование типов?
 Что такое HTTP ? Из чего состоит HTTP протокол?
 Какие есть методы HTTP запросов? Для чего каждый?
 Что такое REST ? RPC ?
 Что такое "линтер" (linter)? Зачем они нужны? Какие линтеры есть для javascript?
 Что такое "jsdoc" ? Зачем он нужен? Примеры тегов
 Что такое пакетный менеджер? Какие пакетные менеджеры есть для js?
 Что делают системы сборки? Какие системы сборки есть для js?
`;

const questions2 = ` Что такое контекст вызова функции? Чем определяется?
 Как изменить this внутри функции? (5 способов)
 чем различаются .call / .apply / .bind
 Что такое сигнатура функции?
 Чем характеризуется функция?
 Что такое прототип?
 Как работает конструктор? Что происходит при вызове со словом new ?
 Как происходит чтение свойств из объекта?
 Как происходит запись свойств в объект?
 Как проверить на принадлежность классу?
 Как работает instanceof ?
 4е принципа ООП
 Виды полиморфизма. И их объяснение
 Событийный цикл в javascript
 Что такое фаза захвата / capturing ?
 Что такое фаза всплытия / bubbling ?
 Как подписаться на событие документа / html элемента?
 Что такое Функция высшего порядка?
 Что такое синхронный / асинхронный код?
 Что такое каррирование ?
 Что такое паттерн цепочка ? Как реализовать?
 В чем разница объявления методов в конструкторе и на .prototype ?
 Что такое 'полифилл'?
 Что такое Promise? Какой стандарт отписывает поведение Promise? Основные пункты стандарта?
 Чем куки (cookie) отличаются от localStorage ?
 Что такое CORS?
 Что такое и какие есть коды ответов HTTP?
 Что такое jsonp-запрос?
 Как код, написанный на ES6 (ES2015-2017) превратить в код, который поддерживается IE10?
 Как реализовать простейший модуль на js?
 Что такое и зачем нужен паттерн модуль? Какие модули существуют в JS?
 Как реализовать подписку на клик по кнопке, которая отработает только один раз? ( с примером кода )
 Какие события не "всплывают" ?
 Что такое делегирование?
 Преимущества и особенности работы с делегированием?
 Какие вспомогательные методы есть для работы с промисами?`;

const questions3 = ``;

const questions4 = ``;

const questions5 = ``;

const shuffleList = list => {
  for (let i = 0; i < list.length; i++) {
    const rand = Math.floor(Math.random() * list.length);
    const tmp = list[rand];
    list[rand] = list[list.length - 1];
    list[list.length - 1] = tmp;
  }
  return list;
};

const $$ = document.querySelector.bind(document);
const questionsStrings = [
  questions0,
  questions1,
  questions2,
  questions3,
  questions4,
  questions5
];
let roundQuestionsNumber = 0;
let i = 0;

const getQuestions = (() => {
  let questions = [];
  const generateQuestions = () => {
    [...document.querySelectorAll('fieldset input[type=checkbox]')].forEach(
      (el, index) => {
        if (el.checked) {
          questions = [
            ...questions,
            ...(questionsStrings[index] || '').trim().split('\n')
          ];
        }
      }
    );

    questions = questions.map(i => i.trim()).filter(Boolean);

    shuffleList(questions);
    shuffleList(questions);
    roundQuestionsNumber = questions.length;
    i = 0;
  };

  return () => {
    if (!questions.length) {
      generateQuestions();
    }
    return questions;
  };
})();

const drawNextQuestion = () => {
  const questions = getQuestions();
  i++;
  const question = questions.pop();
  $$(
    '.question'
  ).innerHTML = `<sup>${i}</sup>/<sub>${roundQuestionsNumber}</sub> > ${question}`;
};

$$('.question').addEventListener('click', drawNextQuestion);
document.body.addEventListener('keyup', ev => {
  const SPACE_KEY_CODE = 32;
  if (ev.key === ' ' || ev.keyCode === SPACE_KEY_CODE) {
    drawNextQuestion();
  }
});
